#include <iostream>
using namespace std;
void main()
{setlocale(LC_ALL, "Ukrainian");
system ("color 0A");
int a,b,c,d,e;
cout<<"Доброго дня, вiтаємо у нашому ресторанi.\n";
cout<<"Будь ласка, виберiть страви:\n";
cout<<"_________________________\n";
cout<<"1-Снiданок\n";
cout<<"2-Обiд\n";
cout<<"3-Вечеря\n";
cin>>b;
if (b==1){
	cout<<"Ви вибрали снiданок, тепер оберiть комплекс снiданку:\n";
	cout<<"4- Риба та картопля.\n";
	cout<<"5- М'ясо та картопля.\n";
	cout<<"6- Рис та котлета.\n";
	cin>>c;
	if (c==4){
		cout<<"Ваше замовлення: Риба та картопля. Смачного!\n";
	}
	if (c==5){
		cout<<"Ваше замовлення: М'ясо та картопля. Смачного!\n";
	}
	if (c==6){
		cout<<"Ваше замовлення: Рис та котлета. Смачного!\n";
	}

}
if (b==2){
	cout<<"Ви вибрали обiд, тепер оберiть комплекс обiду:\n";
	cout<<"7- Борщ та картопля с котлетою.\n";
	cout<<"8- Гороховий суп та рис з м'ясом\n";
	cout<<"9- Грибний суп та макарони з м'ясом\n";
	cin>>d;
	if (d==7){
		cout<<"Ваше замовлення: Борщ та картопля с котлетою. Смачного!\n";
	}
	if (d==8){
		cout<<"Ваше замовлення: Гороховий суп та рис з м'ясом. Смачного!\n";
	}
	if (d==9){
		cout<<"Ваше замовлення: Грибний суп та макарони з м'ясом. Смачного!\n";
	}
}
if (b==3){
	cout<<"Ви вибрали вечерю, тепер оберiть комплекс вечерi:\n";
	cout<<"10- Плов\n";
	cout<<"11- Спагеттi болоньєз\n";
	cout<<"12- Рiзотто з грибами\n";
	cin>>e;
	if (e==10){
		cout<<"Ваше замовлення: Плов. Смачного!\n";
	}
	if (e==11){
		cout<<"Ваше замовлення: Спагетті болоньєз. Смачного!\n";
	}
	if (e==12){
		cout<<"Ваше замовлення: Різотто з грибами. Смачного!\n";
	}

}
}